app/controllers/categories_controller.rb

  def index
    if current_user.email != 'opcionvenezuelaorg@gmail.com'
      aux = (User.find_by(id: current_user.id).id)
      @categories = Category.where(user_id: aux).all
    else
      @categories = Category.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 8], ["LIMIT", 1]]
SELECT  "categories".* FROM "categories" WHERE "categories"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
SELECT "categories".* FROM "categories"

  def create
    @category = Category.new(category_params)
    @category.user_id = User.find_by(id: current_user.id).id
    respond_to do |format|
      if @category.save
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 8], ["LIMIT", 1]]
INSERT INTO "categories" ("category_type", "title", "description", "start_date", "duration", "start_hour", "end_hour", "location", "cost", "client_id", "created_at", "updated_at", "avatar1_file_name", "avatar1_content_type", "avatar1_file_size", "avatar1_updated_at", "avatar2_file_name", "avatar2_content_type", "avatar2_file_size", "avatar2_updated_at", "avatar3_file_name", "avatar3_content_type", "avatar3_file_size", "avatar3_updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14, $15, $16, $17, $18, $19, $20, $21, $22, $23, $24) RETURNING "id"

  def update
      if @category.update(category_params)
---
UPDATE "categories" SET "avatar1_file_name" = $1, "avatar1_content_type" = $2, "avatar1_file_size" = $3, "avatar1_updated_at" = $4, "avatar2_file_name" = $5, "avatar2_content_type" = $6, "avatar2_file_size" = $7, "avatar2_updated_at" = $8, "avatar3_file_name" = $9, "avatar3_content_type" = $10, "avatar3_file_size" = $11, "avatar3_updated_at" = $12, "updated_at" = $13 WHERE "categories"."id" = $14

  def destroy
    if @category.destroy
---
DELETE FROM "categories" WHERE "categories"."id" = $1  [["id", 7]]

    def set_category
      @category = Category.find_by(id: params[:id])
---
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]